cf/Documents/ГрафикСборокИОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ГрафикСборокИОтгрузок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикСборокИОтгрузок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сборка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОтделов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доставка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Понедельник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вторник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Среда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Четверг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пятница</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суббота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Воскресение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОтделов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доставка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Понедельник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вторник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Среда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Четверг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пятница</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суббота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Воскресение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/ГрафикСборокИОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГрафикСборокИОтгрузок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Понедельник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вторник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Среда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Четверг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пятница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Суббота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Воскресение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СборкаОтгрузка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СборкаОтгрузка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОтделов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/СборкаОтгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СборкаОтгрузка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/ГрафикСборокИОтгрузок/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ГрафикСборокИОтгрузок.Записывать = Истина;
	Для Каждого ТекСтрокаСборка Из Сборка Цикл
		
		Движение				 = Движения.ГрафикСборокИОтгрузок.Добавить();
		Движение.Период			 = Дата;
		Движение.СборкаОтгрузка	 = Перечисления.СборкаОтгрузка.Сборка;		
		Движение.Отдел			 = ТекСтрокаСборка.Отдел;
		Движение.Подразделение	 = ТекСтрокаСборка.Подразделение;
		Движение.Город			 = ТекСтрокаСборка.Город;
		Движение.Доставка		 = ТекСтрокаСборка.Доставка;
		Движение.Понедельник	 = ТекСтрокаСборка.Понедельник;
		Движение.Вторник		 = ТекСтрокаСборка.Вторник;
		Движение.Среда			 = ТекСтрокаСборка.Среда;
		Движение.Четверг		 = ТекСтрокаСборка.Четверг;
		Движение.Пятница		 = ТекСтрокаСборка.Пятница;
		Движение.Суббота		 = ТекСтрокаСборка.Суббота;
		Движение.Воскресение	 = ТекСтрокаСборка.Воскресение;
		
	КонецЦикла;
	
	Для Каждого ТекСтрокаОтгрузка Из Отгрузка Цикл
		
		Движение				 = Движения.ГрафикСборокИОтгрузок.Добавить();
		Движение.Период			 = Дата;
		Движение.СборкаОтгрузка	 = Перечисления.СборкаОтгрузка.Отгрузка;		
		Движение.Отдел			 = ТекСтрокаОтгрузка.Отдел;
		Движение.Подразделение	 = ТекСтрокаОтгрузка.Подразделение;
		Движение.Город			 = ТекСтрокаОтгрузка.Город;
		Движение.Доставка		 = ТекСтрокаОтгрузка.Доставка;
		Движение.Понедельник	 = ТекСтрокаОтгрузка.Понедельник;
		Движение.Вторник		 = ТекСтрокаОтгрузка.Вторник;
		Движение.Среда			 = ТекСтрокаОтгрузка.Среда;
		Движение.Четверг		 = ТекСтрокаОтгрузка.Четверг;
		Движение.Пятница		 = ТекСтрокаОтгрузка.Пятница;
		Движение.Суббота		 = ТекСтрокаОтгрузка.Суббота;
		Движение.Воскресение	 = ТекСтрокаОтгрузка.Воскресение;
		
	КонецЦикла;
	
КонецПроцедуры
